In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    [['Snow', 'M', 22],
    ['Tyrion', 'M', 32],
    ['Sansa', 'F', 18],
    ['Arya', 'F', 14]],
    columns = ['name', 'gender', 'age'])

In [3]:
df

     name gender  age
0    Snow      M   22
1  Tyrion      M   32
2   Sansa      F   18
3    Arya      F   14

# 选单列

## 选单列，单对[]为Series

In [4]:
df['name']

0      Snow
1    Tyrion
2     Sansa
3      Arya
Name: name, dtype: object

In [5]:
type(df['name'])

pandas.core.series.Series

## 选单列, 双对[]为DataFrame

In [6]:
df[['name']]

     name
0    Snow
1  Tyrion
2   Sansa
3    Arya

In [7]:
type(df[['name']])

pandas.core.frame.DataFrame

# 选多列

## 选择多列，列名要放在list里

In [8]:
df[['name', 'gender']]

     name gender
0    Snow      M
1  Tyrion      M
2   Sansa      F
3    Arya      F

# 不用逗号，隔开的都是行操作

## 第0行及之后的行，相当于df的全部数据，注意冒号是必须的

In [9]:
df[0:]

     name gender  age
0    Snow      M   22
1  Tyrion      M   32
2   Sansa      F   18
3    Arya      F   14

## 第2行之前的数据（不含第2行）

In [10]:
df[2:]

    name gender  age
2  Sansa      F   18
3   Arya      F   14

## 第0行

In [11]:
df[0:1]

   name gender  age
0  Snow      M   22

## 第1行到第2行（不含第3行）

In [12]:
df[1:3]

     name gender  age
1  Tyrion      M   32
2   Sansa      F   18

## 最后1行

In [13]:
df[-1:]

   name gender  age
3  Arya      F   14

## 倒数第3行到倒数第1行（不包含最后1行即倒数第1行）

### 这里有点烦躁，因为从前数时是从第0行开始，从后数就是从-1开始，毕竟没有-0这一说法

In [14]:
df[-3:-1]

     name gender  age
1  Tyrion      M   32
2   Sansa      F   18

# loc，在知道列名的情况下，df.loc[index, column]选定指定行，列数据

### df.loc[index, column name]，选取指定行和列的数据

In [15]:
df.loc[0, 'name']

'Snow'

## 选取第0行到第2行，name列和age列的数据

### 注意这里的行选取是包含下标的

In [16]:
df.loc[0:2, ['name', 'age']]

     name  age
0    Snow   22
1  Tyrion   32
2   Sansa   18

## 选定指定的第2行和第3行数据，name和age列的数据

In [17]:
df.loc[2:3, ['name', 'age']]

    name  age
2  Sansa   18
3   Arya   14

In [18]:
df.loc[[2,3], ['name', 'age']]

    name  age
2  Sansa   18
3   Arya   14

## 选定name列中gender列是M的数据

In [19]:
df.loc[df['gender']=='M', 'name']

0      Snow
1    Tyrion
Name: name, dtype: object

## 选定name和age列中gender列是M的数据

In [20]:
df.loc[df['gender']=='M', ['name', 'age']]

     name  age
0    Snow   22
1  Tyrion   32

# iloc, 在column name特别长或者index是时间序列等不方便输入的情况下，可以用iloc(i=index)。

**iloc完全用数字来定位。iloc[row_index, colum_index]**

## 第0行第0列的数据

In [22]:
df.iloc[0, 0]

'Snow'

## 第2行第3列的数据

In [29]:
df.iloc[1, 2]

32

## 第1行和第3行，从第0列到第2列（不包含第2列）的数据

In [42]:
df.iloc[[0, 2], 0:2]

    name gender
0   Snow      M
2  Sansa      F

## 第1行到第3行（不包含第3行），第1列到第2列不包含第2列

In [38]:
df.iloc[1:3, [1, 2]]

  gender  age
1      M   32
2      F   18

# ix, ix很强大，loc和iloc的功能都能做到。ix[row_index, column_index]

**ix虽然强大，然而已经不再被推荐。因为在最新的pandas中，ix已经成为deprecated。大概是因为可能混合label和position导致了很多用户问题和bug。所以，用label就用loc，用哪个position就用iloc。**

## 第0行第0列的数据

In [39]:
df.ix[0, 0]

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

'Snow'

**“到”用“:”
<br/>“和”用“,”，逗号要另外加[]**

## 第0行，第1列和第2列的数据

In [43]:
df.ix[0, [1,2]]

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

gender     M
age       22
Name: 0, dtype: object

## 第0行到第2行（包含第3行）， 第1列和第2列的数据

In [44]:
df.ix[0:2, [1, 2]]

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

  gender  age
0      M   22
1      M   32
2      F   18

## 第1行，从第0列到第2列（不包含第2列）的数据

In [45]:
df.ix[1, 0:2]

C:\Program Files\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

name      Tyrion
gender         M
Name: 1, dtype: object

**切片时，iloc行不含下标上限；
<br>loc和ix行包含；
<br/>列iloc和ix都不包含下标上限。**